/*
 Localizable.strings
 SongShift

 Created by Juan Carlos Perez on 4/20/15.
 Copyright © 2015 CP DigitalDarkroom. All rights reserved.
 */

/* - Shown in the playlist selection screen displaying how many songs are present - */
"%d SONGS" = "%d Songs";

/* - Shown when user is alerted 9.3 is required to create a playlist - */
"9_3_PLAYLIST_CREATION_ERROR" = "Creating playlists in your Apple Music cloud library requires iOS 9.3 or greater. Please update to use this feature.";

/* - Shown when user is alerted 9.3 is required to import - */
"9_3_REQUIRED_IMPORT" = "Importing songs to your Apple Music cloud library requires iOS 9.3 or greater. Please update to use this feature.";

/* - Shown in the main screen menu - */
"ABOUT" = "About";

/* - Shown in the about page - */
"ABOUT_BODY" = "SongShift was born from the love of having the music we love on the service we love. Our mission is to help keep you listening to the music you love where you want it. ";

/* - Presented on the purchase pro scren - */
"ADS_DESCRIPTION" = "I know we all hate ads, I do too promise! Unfortunately in todays app store market, they have become a necessary evil :/";

/* - Shown when there was an error logging in a user - */
"AUTH_ERROR" = "Uh oh, something when wrong authenticating. Please try again.";

/* - Shown in the main screen menu - */
"BEGIN_NEW_SHIFT" = "Begin New Shift";

/* - Shown app wide as a way to cancel - */
"CANCEL" = "Cancel";

/* - Shown app wide as a way to close current view - */
"CLOSE" = "Close";

/* - Shown to users when either permission is not set or iCloud music library is off - */
"CLOUD_NOT_READY_ALERT" = "Importing to Apple Music is not possible at this moment. Ensure you have given SongShift permission to access the Music app as well as turned on iCloud Music Library found under Settings -> Music";

/* - Shown in nav bar when selecting destination - */
"DESTINATION" = "Destination";

/* - Shown app wide as a way to dismiss an alert - */
"DISMISS" = "Dismiss";

/* - Shown when processing songs - */
"DETERMINING_IDS" = "Determining Song ID's";

/* - Shown to user when attempting to use a service they have not unlocked - */
"EXPORT_REQUIRES_PURCHASE" = "Exporting from Apple Music to Spotify requires either Pro Unlocked or Spotify Export unlocked in the extras menu";

/* - Shown when import/export is complete - */
"ENJOY_YOUR_MUSIC" = "Enjoy your music";

/* - Shown in AppStore screenshot - */
"ENJOY_YOUR_MUSIC_ANYWHERE" = "Enjoy Your Music Anywhere";

/* - Shown when playlists where not able to be retrieved - */
"PLAYLIST_ERROR_RETRIEVING" = "Error retrieving your playlists. Ensure you have a stable connection and try again.";

/* - Shown when exporting is complete - */
"EXPORT_COMPLETE" = "Export Complete";

/* - Shown during final step of export - */
"EXPORTING_SONGS" = "Exporting Songs";

/* - Shown in the main screen menu - */
"EXTRAS" = "Extras";

/* - Shown at the end of import/export to - */
"FAILED_SONGS" = "Failed Songs";

/* - Shown in AppStore screenshot - */
"FAST_AND_EFFORTLESS" = "Fast and Effortless";

/* - Shown in the main screen menu - */
"HELP_US_GROW" = "Help Us Grow";

/* - Shown to user when deciding whether to import to library or playlist - */
"IMPORT_ALERT_BODY" = "Where would you like to import the contents of this playlist? Remember to allow adequate processing time for large playlists.";

/* - Shown when importing is complete - */
"IMPORT_COMPLETE" = "Import Complete";

/* - Shown when user below 9.3 attempts to import to Apple Music - */
"IMPORT_NOT_SUPPORTED" = "Importing songs from Spotify to Apple Music is not supported on the installed iOS version. Please update to iOS 9.3 or above to be able to use this feature";

/* - Showin the AppStore screenshot - */
"IMPORT_OR_EXPORT" = "Import or Export";

/* - Shown during last step of import - */
"IMPORTING_SONGS" = "Importing Songs";

/* - Shown when any loading happens - */
"LOADING" = "Loading...";

/* - Shown when user doesn't have a previous session to restore to - */
"NO_SESSION_FOUND" = "No previous Spotify session found. Sign in now to get started.");

/* - Shown in the reauthenticate button - */
"REAUTHENTICATE" = "Re-Authenticate";

/* - Shown to non-pro users one time when importing a 100+ track playlist - */
"NON_PRO_LIMITATION" = "Playlists which contain more than 100 tracks will only process the first 100 tracks unless Pro is unlocked in the Extras menu";

/* - Shown when processing songs - */
"PARSING_PLAYLIST" = "Parsing Playlist Songs";

/* - Presented when there is an error creating a new playist - */
"PLAYLIST_CREATION_ERROR" = "There was an error creating a new playlist. Please try again.";

/* - Shown in AppStore Screenshot - */
"PLAYLIST_TO_PLAYLIST" = "Playlist to Playlist Importing and Exporting";

/* - Shown when processing - */
"PROCESSING" = "Processing";

/* - Presented on the purchase pro scren - */
"PRO_DESCRIPTION" = "Unlocking Pro removes the 100 track per playlist limit and unlocks any present and future import/export services.";

/* - Shown on pro button when already unlocked - */
"PRO_UNLOCKED" = "Pro Unlocked";

/* - shown when user is presented when permission error and asked to open settings - */
"OPEN_SETTINGS" = "Open Settings";

/* - Shown in the service selection view when user taps on "Other Services" - */
"OTHER_SERVICES_MESSAGE" = "Although SongShift currently only supports Apple Music and Spotify, I am continuously looking to imporove the app by adding more features. If you've got a service you'd like to see added to available options please drop me an email and let me know!";

/* - Shown in the main screen menu - */
"RATE_APP" = "Rate SongShift";

/* - Shown in the remove ads button - */
"REMOVE_ADS" = "Remove Ads";

/* - Shown when user needs to renew session - */
"RENEW_SESSION" = "Renew session to continue";

/* - Shown on the in-app purchase screeen - */
"RESTORE" = "Restore";

/* - Shown in the view title in the source selection view - */
"SELECT_SOURCE" = "Select Source";

"SELECT_PLAYLIST" = "Select Playlist";

/- *Shown when users previous session has expired -*/
"SESSION_EXPIRED" = "Your previous Spotify session expired. Re-authenticate to continue with a new session.";

/* - Shown in the main screen menu - */
"SHARE" = "Share SongShift";

/* - Shown to the user when tapping on "Help us Grow" - */
"SHARE_MESSAGE" = "Being an indie developer means I don't have the big bucks some companies have to promote my app. This also means I have a much stronger connection with each of you. I can't thank you enough for your support with SongShift.. Thank you for using SongShift and helping make it something I couldn't do on my own.";

/* - Text to be shared when sharing the app - */
"SHARE_TEXT" = "SongShift effortlessly helps you import playlists into Apple Music with incredible ease.";

/* - Shown in the main screen when displaying the number of songs exported - */
"SONGS_EXPORTED" = "Songs Exported";

/* - Shown in the main screen when displaying the number of songs imported - */
"SONGS_IMPORTED" = "Songs Imported";

/* - Shown in extras view - */
"SPOTIFY_EXPORT" = "Spotify Export";

/* - Shown in extras view - */
"SPOTIFY_SERVICE_DESCRIPTION" = "Exporting to Spotify is included in a Pro unlock. If purchased seperately, this will only lift the 100 track per playlist limit when exporting to Spotify.";

"THANK_YOU" = "Thank You";

/* - Shown on purchase button when already unlocked - */
"UNLOCKED" = "Unlocked";

/* - Shown on the unlock pro button - */
"UNLOCK_PRO" = "Unlock Pro";

/* - Shown on purchase button when unlock is needed - */
"UNLOCK_SERVICE" = "Unlock Service";

/* - Shown when there are failed songs - */
"VIEW_FAILED_SONGS" = "View Failed Songs";

